## Aadhar Biometric

In [3]:
import pandas as pd

In [4]:
df1 = pd.read_csv("api_data_aadhar_biometric_0_500000.csv")
df2 = pd.read_csv("api_data_aadhar_biometric_1000000_1500000.csv")
df3 = pd.read_csv("api_data_aadhar_biometric_1500000_1861108.csv")
df4 = pd.read_csv("api_data_aadhar_biometric_500000_1000000.csv")

In [5]:
df1.sample(5)

,date,state,district,pincode,bio_age_5_17,bio_age_17_
300711,10-09-2025,Arunachal Pradesh,Longding,786631,0,1
179349,04-09-2025,Jharkhand,Deoghar,814146,4,1
268410,09-09-2025,Kerala,Palakkad,679122,1,2
442898,17-09-2025,Tamil Nadu,Thoothukkudi,628502,11,24
119532,01-09-2025,Himachal Pradesh,Hamirpur,177040,5,1

In [ ]:
df1["date"] = pd.to_datetime(df1["date"], format="%d-%m-%Y")

In [ ]:
df1.sort_values(by="date")

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,2025-03-01,Haryana,Mahendragarh,123029,280,577
14640,2025-03-01,Uttar Pradesh,Ghazipur,233232,168,47
14639,2025-03-01,West Bengal,West Midnapore,721133,47,153
14638,2025-03-01,Gujarat,Anand,388335,24,70
14637,2025-03-01,Rajasthan,Rajsamand,313322,79,76
...,...,...,...,...,...,...
487109,2025-09-19,Jharkhand,Ranchi,829210,3,4
487108,2025-09-19,Jharkhand,Ramgarh,829150,5,7
487107,2025-09-19,Jharkhand,Ramgarh,829143,2,1
487105,2025-09-19,Jharkhand,Ramgarh,825326,0,1
499999,2025-09-19,Goa,North Goa,403106,1,0

In [5]:
df2.sample(5)

,date,state,district,pincode,bio_age_5_17,bio_age_17_
462205,07-12-2025,Maharashtra,Bhandara,441806,2,2
164943,14-11-2025,Rajasthan,Pratapgarh,312605,25,31
12807,07-11-2025,Karnataka,Mysore,570003,0,2
301282,25-11-2025,Karnataka,Belagavi,591110,1,0
82684,10-11-2025,Kerala,Kozhikode,673027,2,8

In [ ]:
df2["date"] = pd.to_datetime(df2["date"], format="%d-%m-%Y")

In [ ]:
df2.sort_values(by="date")

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,2025-11-07,Haryana,Yamuna Nagar,135002,4,6
14284,2025-11-07,Madhya Pradesh,Pandhurna,480331,0,1
14283,2025-11-07,Madhya Pradesh,Niwari,472246,1,1
14282,2025-11-07,Madhya Pradesh,Neemuch,458226,3,3
14281,2025-11-07,Madhya Pradesh,Neemuch,458116,0,2
...,...,...,...,...,...,...
487167,2025-12-08,Andhra Pradesh,Chittoor,517319,2,2
487166,2025-12-08,Andhra Pradesh,Chittoor,517280,6,4
487165,2025-12-08,Andhra Pradesh,Chittoor,517236,3,3
487163,2025-12-08,Andhra Pradesh,Chittoor,517194,4,7
499999,2025-12-08,Gujarat,Vadodara,391530,3,7

In [18]:
df3.sample(5)

,date,state,district,pincode,bio_age_5_17,bio_age_17_
126203,14-12-2025,Karnataka,Bangalore,560036,4,3
268838,25-12-2025,Telangana,Bhadradri Kothagudem,507301,6,0
150273,15-12-2025,Andhra Pradesh,Nizamabad,503224,0,1
315150,27-12-2025,Kerala,Kozhikode,673307,10,8
238168,20-12-2025,Assam,Sonitpur,784001,7,0

In [ ]:
df3["date"] = pd.to_datetime(df3["date"], format="%d-%m-%Y")

In [ ]:
df3.sort_values(by="date")

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,2025-12-08,Uttar Pradesh,Moradabad,244411,4,2
2764,2025-12-08,Tamil Nadu,Villupuram,605752,4,3
2765,2025-12-08,Tamil Nadu,Villupuram,605754,5,1
2766,2025-12-08,Tamil Nadu,Villupuram,605755,4,1
2767,2025-12-08,Tamil Nadu,Villupuram,605756,2,0
...,...,...,...,...,...,...
345829,2025-12-29,Tamil Nadu,Tiruvannamalai,632311,15,3
345828,2025-12-29,Tamil Nadu,Tiruvannamalai,632301,17,3
345827,2025-12-29,Tamil Nadu,Tiruvannamalai,606902,14,5
345847,2025-12-29,Tamil Nadu,Vellore,635808,7,1
361107,2025-12-29,West Bengal,West Midnapore,721457,0,1

In [ ]:
df4["date"] = pd.to_datetime(df4["date"], format="%d-%m-%Y")

In [ ]:
df4.sort_values(by="date")

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,2025-09-19,Goa,North Goa,403502,0,4
2543,2025-09-19,Uttar Pradesh,Faizabad,225407,53,5
2544,2025-09-19,Uttar Pradesh,Farrukhabad,207501,65,6
2545,2025-09-19,Uttar Pradesh,Farrukhabad,207502,7,13
2546,2025-09-19,Uttar Pradesh,Farrukhabad,209501,2,2
...,...,...,...,...,...,...
498377,2025-11-07,Rajasthan,Dholpur,328021,30,10
498378,2025-11-07,Rajasthan,Dholpur,328022,19,10
498379,2025-11-07,Rajasthan,Dholpur,328026,4,4
498372,2025-11-07,Rajasthan,Dausa,303507,5,5
499999,2025-11-07,Kerala,Ernakulam,682026,1,3

#### Conclusion

- We have data starting from 1st March 2025 to 29th December 2025
- Biometric update records are available across states and districts for different dates, with some locations showing zero update activity on certain days.
- One column is of age group of 5 years - 17 years
- Another column is of age group of 17 years+
- There are some 0 values in `bio_age_5_17` and `bio_age_17_` which indicates no biometric updation is done on that particular date